tylertms/cortex-m4-sim/src/kinetis_k22.c
#include "cortex_m4_sim/kinetis_k22.h"

#include <stdlib.h>
#include <string.h>

#include "kinetis_k22_internal.h"

static bool valid_range(uint32_t address, uint8_t size, uint32_t base, size_t length) {
    return size != 0 && address >= base &&
           (uint64_t)address + size <= (uint64_t)base + length;
}

static uint32_t load_little_endian(const uint8_t* bytes, uint8_t size) {
    uint32_t value = 0;
    for (uint8_t index = 0; index < size; index++) {
        value |= (uint32_t)bytes[index] << (index * 8u);
    }
    return value;
}

static void store_little_endian(uint8_t* bytes, uint8_t size, uint32_t value) {
    for (uint8_t index = 0; index < size; index++) {
        bytes[index] = (uint8_t)(value >> (index * 8u));
    }
}

static bool flash_access_allowed(const KinetisK22* device, CortexM4Access access,
                                 uint8_t master, bool write) {
    if (access == CORTEX_M4_ACCESS_DEBUG) {
        return true;
    }
    const uint32_t offset = 0x4001f000u - K22_PERIPHERAL_BASE;
    const uint32_t protection = load_little_endian(device->peripheral + offset, 4u);
    const uint8_t permission = (uint8_t)((protection >> (master * 2u)) & 3u);
    return write ? (permission & 2u) != 0u : (permission & 1u) != 0u;
}

static uint32_t fmc_raw_load(const KinetisK22* device, uint32_t address) {
    return load_little_endian(device->peripheral + address - K22_PERIPHERAL_BASE, 4u);
}

static void fmc_raw_store(KinetisK22* device, uint32_t address, uint32_t value) {
    store_little_endian(device->peripheral + address - K22_PERIPHERAL_BASE, 4u, value);
}

static uint32_t fmc_tag_address(uint8_t way, uint8_t set) {
    return 0x4001f100u + ((uint32_t)way * 4u + set) * 4u;
}

static uint32_t fmc_data_address(uint8_t way, uint8_t set, uint8_t memory_word) {
    return 0x4001f200u + ((uint32_t)way * 4u + set) * 16u + (3u - memory_word) * 4u;
}

static uint32_t fmc_tag_value(const KinetisK22* device, uint32_t line);

static void fmc_clear_entry(KinetisK22* device, uint8_t way, uint8_t set) {
    fmc_raw_store(device, fmc_tag_address(way, set), 0u);
    for (uint8_t word = 0u; word < 4u; word++)
        fmc_raw_store(device, fmc_data_address(way, set, word), 0u);
    device->fmc_bank[way][set] = 0u;
    device->fmc_age[way][set] = 0u;
}

static void fmc_clear_cache(KinetisK22* device) {
    for (uint8_t way = 0u; way < 4u; way++) {
        for (uint8_t set = 0u; set < 4u; set++)
            fmc_clear_entry(device, way, set);
    }
    device->fmc_access_count = 0u;
}

static void fmc_invalidate_line(KinetisK22* device, uint8_t bank, uint32_t offset) {
    const uint8_t set = (uint8_t)((offset >> 4u) & 3u);
    const uint32_t tag = fmc_tag_value(device, offset & ~15u);
    for (uint8_t way = 0u; way < 4u; way++) {
        if (device->fmc_bank[way][set] == bank &&
            fmc_raw_load(device, fmc_tag_address(way, set)) == tag)
            fmc_clear_entry(device, way, set);
    }
}

static uint32_t fmc_tag_value(const KinetisK22* device, uint32_t line) {
    const K22RegisterDescriptor* descriptor =
        k22_register_manifest_lookup(device->profile->id, 0x4001f100u, 32u);
    return (line & descriptor->write_mask & ~1u) | 1u;
}

static bool fmc_way_allowed(uint8_t mode, bool instruction, uint8_t way) {
    if (mode == 2u)
        return instruction ? way < 2u : way >= 2u;
    if (mode == 3u)
        return instruction ? way < 3u : way == 3u;
    return true;
}

static uint8_t fmc_replacement_way(KinetisK22* device, uint8_t set, bool instruction) {
    const uint32_t control = fmc_raw_load(device, 0x4001f004u);
    const uint8_t locked = (uint8_t)((control >> 24u) & 0x0fu);
    const uint8_t mode = (uint8_t)((control >> 5u) & 7u);
    for (uint8_t way = 0u; way < 4u; way++) {
        if ((locked & (1u << way)) == 0u && fmc_way_allowed(mode, instruction, way) &&
            (fmc_raw_load(device, fmc_tag_address(way, set)) & 1u) == 0u)
            return way;
    }
    uint8_t selected = UINT8_MAX;
    uint64_t oldest = UINT64_MAX;
    for (uint8_t way = 0u; way < 4u; way++) {
        if ((locked & (1u << way)) == 0u && fmc_way_allowed(mode, instruction, way) &&
            device->fmc_age[way][set] < oldest) {
            selected = way;
            oldest = device->fmc_age[way][set];
        }
    }
    return selected;
}

static uint8_t fmc_source_byte(KinetisK22* device, uint8_t bank, uint32_t offset) {
    if (bank == 0u)
        return offset < device->configuration.flash_size ? device->flash[offset]
                                                         : UINT8_MAX;
    uint32_t value = UINT32_MAX;
    return k22_data_read(device->data, device->profile->flexnvm_address + offset, 1u,
                         &value)
               ? (uint8_t)value
               : UINT8_MAX;
}

static uint8_t fmc_cached_byte(KinetisK22* device, uint8_t bank, uint32_t offset,
                               CortexM4Access access) {
    const uint32_t line = offset & ~15u;
    const uint8_t set = (uint8_t)((offset >> 4u) & 3u);
    const uint32_t tag = fmc_tag_value(device, line);
    uint8_t way = UINT8_MAX;
    for (uint8_t candidate = 0u; candidate < 4u; candidate++) {
        if (device->fmc_bank[candidate][set] == bank &&
            fmc_raw_load(device, fmc_tag_address(candidate, set)) == tag) {
            way = candidate;
            break;
        }
    }
    if (way == UINT8_MAX) {
        way = fmc_replacement_way(device, set, access == CORTEX_M4_ACCESS_INSTRUCTION);
        if (way == UINT8_MAX)
            return fmc_source_byte(device, bank, offset);
        for (uint8_t word = 0u; word < 4u; word++) {
            uint32_t value = 0u;
            for (uint8_t byte = 0u; byte < 4u; byte++) {
                const uint32_t source = line + (uint32_t)word * 4u + byte;
                value |= (uint32_t)fmc_source_byte(device, bank, source) << (byte * 8u);
            }
            fmc_raw_store(device, fmc_data_address(way, set, word), value);
        }
        fmc_raw_store(device, fmc_tag_address(way, set), tag);
        device->fmc_bank[way][set] = bank;
    }
    device->fmc_age[way][set] = ++device->fmc_access_count;
    const uint8_t word = (uint8_t)((offset >> 2u) & 3u);
    return (uint8_t)(fmc_raw_load(device, fmc_data_address(way, set, word)) >>
                     ((offset & 3u) * 8u));
}

static bool fmc_cache_enabled(const KinetisK22* device, uint8_t bank,
                              CortexM4Access access) {
    if (access == CORTEX_M4_ACCESS_DEBUG)
        return false;
    const uint32_t control = fmc_raw_load(device, 0x4001f004u + (uint32_t)bank * 4u);
    return (control & (access == CORTEX_M4_ACCESS_INSTRUCTION ? 8u : 16u)) != 0u;
}

static bool sysmpu_access_allowed(KinetisK22* device, uint32_t address, uint8_t size,
                                  uint8_t master, bool supervisor, K22SysMpuAccess access) {
    if (!k22_profile_has_peripheral(device->profile, K22_PERIPHERAL_SYSMPU) ||
        !k22_io_clock_enabled(&device->io, K22_PERIPHERAL_SYSMPU))
        return true;
    return k22_io_sysmpu_access(&device->io, address, master, supervisor, access) &&
           k22_io_sysmpu_access(&device->io, address + size - 1u, master, supervisor,
                                access);
}

static bool memory_read_unprotected(KinetisK22* device, uint32_t address, uint8_t size,
                                    CortexM4Access access, uint8_t flash_master,
                                    uint32_t* value) {
    if (device == NULL || value == NULL || (size != 1 && size != 2 && size != 4)) {
        return false;
    }
    if (valid_range(address, size, K22_FLASH_BASE, device->configuration.flash_size)) {
        if (!flash_access_allowed(device, access, flash_master, false)) {
            return false;
        }
        if (fmc_cache_enabled(device, 0u, access)) {
            *value = 0u;
            for (uint8_t index = 0u; index < size; index++)
                *value |= (uint32_t)fmc_cached_byte(device, 0u, address + index, access)
                          << (index * 8u);
        } else {
            *value = load_little_endian(device->flash + address, size);
        }
        return true;
    }
    if (valid_range(address, size, device->sram_base, device->configuration.sram_size)) {
        *value = load_little_endian(device->sram + address - device->sram_base, size);
        return true;
    }
    if (device->profile->flexnvm_size != 0u &&
        valid_range(address, size, device->profile->flexnvm_address,
                    device->profile->flexnvm_size)) {
        if (!flash_access_allowed(device, access, flash_master, false))
            return false;
        const uint32_t offset = address - device->profile->flexnvm_address;
        if (fmc_cache_enabled(device, 1u, access)) {
            *value = 0u;
            for (uint8_t index = 0u; index < size; index++)
                *value |= (uint32_t)fmc_cached_byte(device, 1u, offset + index, access)
                          << (index * 8u);
            return true;
        }
        return k22_data_read(device->data, address, size, value);
    }
    if (device->profile->flexram_size != 0u &&
        valid_range(address, size, device->profile->flexram_address,
                    device->profile->flexram_size)) {
        return flash_access_allowed(device, access, flash_master, false) &&
               k22_data_read(device->data, address, size, value);
    }
    if (device->flexbus_memory != NULL &&
        valid_range(address, size, device->flexbus_address, device->flexbus_size) &&
        k22_io_flexbus_transfer(&device->io, address, size, false, 0u)) {
        *value = load_little_endian(
            device->flexbus_memory + address - device->flexbus_address, size);
        return true;
    }
    return kinetis_k22_peripheral_read(device, address, size, access, value);
}

static bool memory_write_unprotected(KinetisK22* device, uint32_t address, uint8_t size,
                                     CortexM4Access access, uint8_t flash_master,
                                     uint32_t value) {
    if (device == NULL || (size != 1 && size != 2 && size != 4)) {
        return false;
    }
    if (valid_range(address, size, K22_FLASH_BASE, device->configuration.flash_size)) {
        if (access != CORTEX_M4_ACCESS_DEBUG) {
            return false;
        }
        store_little_endian(device->flash + address, size, value);
        fmc_invalidate_line(device, 0u, address);
        fmc_invalidate_line(device, 0u, address + size - 1u);
        return true;
    }
    if (valid_range(address, size, device->sram_base, device->configuration.sram_size)) {
        store_little_endian(device->sram + address - device->sram_base, size, value);
        return true;
    }
    if (device->profile->flexnvm_size != 0u &&
        valid_range(address, size, device->profile->flexnvm_address,
                    device->profile->flexnvm_size)) {
        if (access != CORTEX_M4_ACCESS_DEBUG ||
            !k22_data_write(device->data, address, size, value))
            return false;
        const uint32_t offset = address - device->profile->flexnvm_address;
        fmc_invalidate_line(device, 1u, offset);
        fmc_invalidate_line(device, 1u, offset + size - 1u);
        return true;
    }
    if (device->profile->flexram_size != 0u &&
        valid_range(address, size, device->profile->flexram_address,
                    device->profile->flexram_size)) {
        return flash_access_allowed(device, access, flash_master, true) &&
               k22_data_write(device->data, address, size, value);
    }
    if (device->flexbus_memory != NULL && !device->flexbus_read_only &&
        valid_range(address, size, device->flexbus_address, device->flexbus_size) &&
        k22_io_flexbus_transfer(&device->io, address, size, true, value)) {
        store_little_endian(device->flexbus_memory + address - device->flexbus_address,
                            size, value);
        return true;
    }
    return kinetis_k22_peripheral_write(device, address, size, access, value);
}

bool kinetis_k22_memory_read(KinetisK22* device, uint32_t address, uint8_t size,
                             CortexM4Access access, uint32_t* value) {
    if (device == NULL || value == NULL || (size != 1 && size != 2 && size != 4))
        return false;
    if (access != CORTEX_M4_ACCESS_DEBUG) {
        const uint8_t master = access == CORTEX_M4_ACCESS_INSTRUCTION ? 0u : 1u;
        const bool supervisor =
            access != CORTEX_M4_ACCESS_UNPRIVILEGED_DATA &&
            (access != CORTEX_M4_ACCESS_INSTRUCTION || device->cpu == NULL ||
             (cortex_m4_get_xpsr(device->cpu) & 0x1ffu) != 0u ||
             (cortex_m4_get_control(device->cpu) & 1u) == 0u);
        const K22SysMpuAccess operation =
            access == CORTEX_M4_ACCESS_INSTRUCTION ? K22_SYSMPU_EXECUTE : K22_SYSMPU_READ;
        if (!sysmpu_access_allowed(device, address, size, master, supervisor, operation))
            return false;
    }
    const uint8_t master = access == CORTEX_M4_ACCESS_INSTRUCTION ? 0u : 1u;
    return memory_read_unprotected(device, address, size, access, master, value);
}

