tylertms/cortex-m4-sim/src/kinetis_k22.c
bool kinetis_k22_memory_write(KinetisK22* device, uint32_t address, uint8_t size,
                              CortexM4Access access, uint32_t value) {
    if (device == NULL || (size != 1 && size != 2 && size != 4))
        return false;
    if (access != CORTEX_M4_ACCESS_DEBUG) {
        const bool supervisor = access != CORTEX_M4_ACCESS_UNPRIVILEGED_DATA;
        if (!sysmpu_access_allowed(device, address, size, 1u, supervisor, K22_SYSMPU_WRITE))
            return false;
    }
    return memory_write_unprotected(device, address, size, access, 1u, value);
}

bool kinetis_k22_dma_read(KinetisK22* device, uint32_t address, uint8_t size,
                          uint32_t* value) {
    return device != NULL && value != NULL && (size == 1u || size == 2u || size == 4u) &&
           sysmpu_access_allowed(device, address, size, 2u, true, K22_SYSMPU_READ) &&
           memory_read_unprotected(device, address, size, CORTEX_M4_ACCESS_DATA, 2u, value);
}

bool kinetis_k22_dma_write(KinetisK22* device, uint32_t address, uint8_t size,
                           uint32_t value) {
    return device != NULL && (size == 1u || size == 2u || size == 4u) &&
           sysmpu_access_allowed(device, address, size, 2u, true, K22_SYSMPU_WRITE) &&
           memory_write_unprotected(device, address, size, CORTEX_M4_ACCESS_DATA, 2u,
                                    value);
}

bool kinetis_k22_flash_controller_write(KinetisK22* device, uint32_t address, uint8_t size,
                                        uint32_t value) {
    if (device == NULL || (size != 1u && size != 2u && size != 4u) ||
        !valid_range(address, size, K22_FLASH_BASE, device->configuration.flash_size))
        return false;
    store_little_endian(device->flash + address, size, value);
    return true;
}

static const K22RegisterDescriptor* bit_band_descriptor(const KinetisK22* device,
                                                        uint32_t byte_address) {
    for (size_t index = 0; index < device->manifest->register_count; index++) {
        const K22RegisterDescriptor* descriptor = &device->manifest->registers[index];
        const uint8_t size = (uint8_t)(descriptor->width / 8u);
        if (byte_address >= descriptor->address &&
            byte_address - descriptor->address < size) {
            return descriptor;
        }
    }
    return NULL;
}

static bool bit_band_read(KinetisK22* device, uint32_t address, CortexM4Access access,
                          uint32_t* value) {
    if ((address & 3u) != 0) {
        return false;
    }
    const uint32_t alias = address - K22_BIT_BAND_BASE;
    const uint32_t byte_address = K22_PERIPHERAL_BASE + alias / 32u;
    const uint8_t bit_in_byte = (uint8_t)((alias / 4u) & 7u);
    const K22RegisterDescriptor* descriptor = bit_band_descriptor(device, byte_address);
    if (descriptor == NULL || (descriptor->access & K22_REGISTER_ACCESS_READ) == 0) {
        return false;
    }
    const uint8_t bit = (uint8_t)((byte_address - descriptor->address) * 8u + bit_in_byte);
    const uint32_t mask = 1u << bit;
    if ((descriptor->implemented_mask & descriptor->read_mask & mask) == 0) {
        return false;
    }
    uint32_t register_value = 0;
    if (!kinetis_k22_peripheral_read(device, descriptor->address,
                                     (uint8_t)(descriptor->width / 8u), access,
                                     &register_value)) {
        return false;
    }
    *value = (register_value & mask) != 0;
    return true;
}

static bool bit_band_write(KinetisK22* device, uint32_t address, CortexM4Access access,
                           uint32_t value) {
    if ((address & 3u) != 0) {
        return false;
    }
    const uint32_t alias = address - K22_BIT_BAND_BASE;
    const uint32_t byte_address = K22_PERIPHERAL_BASE + alias / 32u;
    const uint8_t bit_in_byte = (uint8_t)((alias / 4u) & 7u);
    const K22RegisterDescriptor* descriptor = bit_band_descriptor(device, byte_address);
    if (descriptor == NULL || (descriptor->access & K22_REGISTER_ACCESS_WRITE) == 0) {
        return false;
    }
    const uint8_t bit = (uint8_t)((byte_address - descriptor->address) * 8u + bit_in_byte);
    const uint32_t mask = 1u << bit;
    if ((descriptor->implemented_mask & descriptor->write_mask & mask) == 0) {
        return false;
    }
    uint32_t register_value = 0;
    if (!kinetis_k22_peripheral_read(device, descriptor->address,
                                     (uint8_t)(descriptor->width / 8u), access,
                                     &register_value)) {
        return false;
    }
    register_value &= ~descriptor->w1c_mask;
    if ((descriptor->w1c_mask & mask) != 0) {
        if ((value & 1u) != 0) {
            register_value |= mask;
        }
    } else {
        register_value = (value & 1u) != 0 ? register_value | mask : register_value & ~mask;
    }
    return kinetis_k22_peripheral_write(device, descriptor->address,
                                        (uint8_t)(descriptor->width / 8u), access,
                                        register_value);
}

static bool k22_read_bus(void* context, uint32_t address, uint8_t size,
                         CortexM4Access access, uint32_t* value) {
    KinetisK22* device = context;
    if (address >= K22_BIT_BAND_BASE && address < K22_BIT_BAND_BASE + K22_BIT_BAND_SIZE) {
        return (size == 1 || size == 2 || size == 4) &&
               bit_band_read(device, address, access, value);
    }
    return kinetis_k22_memory_read(device, address, size, access, value);
}

static bool k22_write_bus(void* context, uint32_t address, uint8_t size,
                          CortexM4Access access, uint32_t value) {
    KinetisK22* device = context;
    if (address >= K22_BIT_BAND_BASE && address < K22_BIT_BAND_BASE + K22_BIT_BAND_SIZE) {
        return (size == 1 || size == 2 || size == 4) &&
               bit_band_write(device, address, access, value);
    }
    return kinetis_k22_memory_write(device, address, size, access, value);
}

static void k22_advance_bus(void* context, uint32_t cycles) {
    KinetisK22* device = context;
    device->cycles += cycles;
    kinetis_k22_peripheral_advance(device, cycles);
}

static void k22_reset_bus(void* context) { kinetis_k22_warm_reset(context, 0, 0x04u); }

KinetisK22Configuration kinetis_k22_default_configuration(void) {
    KinetisK22Configuration configuration;
    memset(&configuration, 0, sizeof(configuration));
    configuration.profile = KINETIS_K22_PROFILE_MK22FN51212;
    configuration.package = KINETIS_K22_PACKAGE_DEFAULT;
    configuration.flash_size = 512u * 1024u;
    configuration.sram_size = 128u * 1024u;
    configuration.external_oscillator_hz = 8000000u;
    configuration.rtc_oscillator_hz = 32768u;
    return configuration;
}

